home/programs/emacs/emacs.org
#+title: Emacs Configuration
#+author: icurry
#+language: en
#+options: toc:2 num:t author:t
#+starupt: content

* Introduction and Overview

* Initialization of Emacs (=init.el=)
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./init.el
:END:

#+begin_src emacs-lisp
  ;;; init.el --- init.el

  ;;; Commentary:

  ;;; Code:
#+end_src

#+begin_src emacs-lisp
  ;; ===Check Emacs Version===
  (when (version< emacs-version "29.1")
    (error "This setup is only guarunteed to work on 29.1, disable this line to load anyways."))
#+end_src

#+begin_src emacs-lisp
  ;; ===Basic Settings===
  (setq frame-title-format "%b")      ;; Set window title to buffer name
  (setq initial-scratch-message ";; Scratch Buffer\n\n")
  (setq initial-buffer-choice t)      ;; Scratch as initial buffer
  (setq make-backup-files nil)        ;; No more file~ everywhere
  (setq inhibit-startup-message t)    ;; Starts on blank screen
  (scroll-bar-mode -1)                ;; Disable visible scrollbar
  (tool-bar-mode -1)                  ;; Disable tool bar
  (menu-bar-mode -1)                  ;; Disable menu bar
  (tooltip-mode -1)                   ;; Disable tooltips
  (set-fringe-mode 10)                ;; No idea what this does
#+end_src

#+begin_src emacs-lisp
  ;; ===Enable Disabled Functions===
  (dolist (c '(narrow-to-region narrow-to-page upcase-region downcase-region))
    (put c 'disabled nil))
#+end_src

#+begin_src emacs-lisp
  ;; ===Disable Custom===
  (setq custom-file (make-temp-file "emacs-custom-"))
#+end_src

#+begin_src emacs-lisp
  ;; ===Package Initialization===
  (require 'package)
  (setq package-archives '(("melpa" . "https://melpa.org/packages/")
                           ("elpa" . "https://elpa.gnu.org/packages/")
                           ("nongnu" . "https://elpa.nongnu.org/nongnu/"))) ;; Setting Repos
  (package-initialize)
  (unless package-archive-contents
    (package-refresh-contents))
#+end_src

#+begin_src emacs-lisp
  ;; ===use-package Initialization===
  (unless (package-installed-p 'use-package)
    (package-install 'use-package))
  (require 'use-package)
#+end_src

#+begin_src emacs-lisp
  ;; ===Load Modules and Packages===
  (dolist (path '("cur-lisp" "cur-config"))
    (add-to-list 'load-path (locate-user-emacs-file path)))
#+end_src

#+begin_src emacs-lisp
  ;; =====================
  ;; == Loading Modules ==
  ;; =====================

  ;; ===Essentials===
  (require 'cur-config-essentials)
  (require 'cur-config-bindings)
  (require 'cur-config-help)
  (require 'cur-config-dired)

  ;; ===Interfaces===
  (require 'cur-config-faces)
  (require 'cur-config-completion)
  (require 'cur-config-windows)
  (require 'cur-modeline)

  ;; ===Languages===
  (require 'cur-config-ide)
  (require 'cur-config-elisp)
  (require 'cur-config-java)
  (require 'cur-config-markup)
  (require 'cur-config-nix)
  (require 'cur-config-rust)
  (require 'cur-config-haskell)
  (require 'cur-config-c)
  (require 'cur-config-zig)
  (require 'cur-config-go)

  ;; ===Terminal Apps===
  (require 'cur-config-shell)

  ;; ===Word Processing===
  (require 'cur-config-org)

  ;; ===Misc===
  (require 'cur-config-smol-net)
  (require 'cur-config-elcord)

  ;; ===Direnv is Last===
  (require 'cur-config-direnv)
#+end_src

#+begin_src emacs-lisp
  (provide 'init)
  ;;; init.el ends here
#+end_src

* Configuration Modules

** Essential configuration (=cur-config-essentials.el=)
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./cur-config/cur-config-essentials.el
:END:
#+begin_src emacs-lisp
  ;;; cur-config-essentials.el --- essentials for emacs

  ;;; Commentary:

  ;;; Code:
#+end_src

#+begin_src emacs-lisp
  ;; ===Parens===
  (use-package paren
    :ensure nil
    :demand t
    :custom
    (show-paren-delay 0 "No delay for paren highlighting"))
#+end_src

#+begin_src emacs-lisp
  ;; ===Line Numbers===
  (column-number-mode)
  (global-display-line-numbers-mode t)
  (setq display-line-numbers-type t)
  ;; Disable line numbers for terminal modes
  (dolist (mode '(dired-mode-hook
                  term-mode-hook
                  vterm-mode-hook
                  shell-mode-hook
                  eshell-mode-hook
                  eat-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 0))))
#+end_src

#+begin_src emacs-lisp
  (provide 'cur-config-essentials)
  ;;; cur-config-essentials.el ends here
#+end_src

** Key bindings configurations (=cur-config-bindings.el=)
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./cur-config/cur-config-bindings.el
:END:

#+begin_src emacs-lisp
  ;;; cur-config-bindings.el --- emacs keybindings

  ;;; Commentary:

  ;;; Code:
#+end_src

#+begin_src emacs-lisp
  ;; ===Hydra===
  (use-package hydra
    :demand t)
#+end_src

#+begin_src emacs-lisp
  ;; ===Meow Setup===
  (use-package meow
    :after (hydra)
    :demand t
    :preface
    (defvar cur/sub-leader-keymap
      (let ((map (make-sparse-keymap)))
        map)
      "The keymap for quick command/function execution.")
    (defvar cur/projectile-map
      (let ((map (make-sparse-keymap)))
        map)
      "Keymap for projectile command execution from the leader key.")
    (defvar cur/toggle-map
      (let ((map (make-sparse-keymap)))
        map)
      "Keymap for commands that change settings from the leader key.")
    (defvar cur/alignment-map
      (let ((map (make-sparse-keymap)))
        map)
      "Keymap for commands that change alignment and cursor display.")
    (defun cur/kmacro-toggle ()
      (interactive)
      (cond
       (defining-kbd-macro
        (call-interactively #'meow-end-kmacro))
       (t
        (call-interactively #'meow-start-kmacro))))
    (defhydra cur/window (:hint nil)
      "
  ^Movement^            ^Splitting^               ^Manipulation
  ^--------^------------^---------^---------------^--------------
  _h_: left             _1_: only window          _H_: swap left
  _j_: down             _2_: split vertical       _J_: swap down
  _k_: up               _3_: split horizontal     _K_: swap up
  _l_: right            _0_: close window         _L_: swap right
  _o_: other window
  "
      ("RET" ignore "finished" :exit t)
      ("w" other-window "other window" :exit t)
      ("." delete-other-windows "only window" :exit t)
      ("f" find-file-other-window "file in new window" :exit t)
      ("v" cur/split-and-follow-vertically "split vertical" :exit t)
      (";" cur/split-and-follow-horizontally "split horizontal" :exit t)
      ("c" delete-window "delete window" :exit t)

      ("o" other-window)
      ("h" windmove-left)
      ("j" windmove-down)
      ("k" windmove-up)
      ("l" windmove-right)

      ("1" delete-other-windows)
      ("2" cur/split-and-follow-vertically)
      ("3" cur/split-and-follow-horizontally)
      ("0" delete-window)

      ("H" windmove-swap-states-left)
      ("J" windmove-swap-states-down)
      ("K" windmove-swap-states-up)
      ("L" windmove-swap-states-right))
    (defhydra cur/goto (:hint nil)
      "
  _g_:  goto line         _a_:  beginning of line     _,_: buffer start     _n_: next buffer hydra
  _s_: to indentation     _e_:  end of line           _._: buffer end       _p_: prev buffer hydra
  "
      ("g" meow-goto-line :exit t)
      ("a" move-beginning-of-line :exit t)
      ("e" move-end-of-line :exit t)
      ("m" back-to-indentation :exit t)
      ("s" back-to-indentation :exit t)
      ("," beginning-of-buffer :exit t)
      ("." end-of-buffer :exit t)
      ("n" cur/hydra-buffer-cycle/next-buffer :exit t)
      ("p" cur/hydra-buffer-cycle/previous-buffer :exit t))
    (defun meow-setup ()
      (meow-motion-overwrite-define-key
       '("j" . meow-next)
       '("k" . meow-prev)
       '("<escape>" . ignore))
      (meow-leader-define-key
       ;; ===Top Row===
       '("1" . delete-other-windows)
       '("2" . cur/split-and-follow-vertically)
       '("3" . cur/split-and-follow-horizontally)
       ;'("4" . )
       ;'("5" . )
       ;'("6" . )
       ;'("7" . )
       ;'("8" . )
       ;'("9" . )
       '("0" . delete-window)

       ;; ===2nd Row===
       ;'("TAB"  . )
       '("q" . comment-dwim)
       '("w" . cur/window/body)
       ;'("e" . )
       '("r" . query-replace)
       (cons "t" cur/toggle-map)
       ;'("y" . )
       '("u" . universal-argument)
       ;'("i" . )
       ;'("o" . )
       (cons "p" cur/projectile-map)
       ;'("-" . )

       ;; ===3rd Row===
       ;'("<escape>" . )
       ;'("a" . )
       '("s" . save-buffer)
       '("d" . kill-current-buffer)
       '("f" . counsel-find-file)
       ;'("g" . )
       ;'("h" . )
       '("j" . other-window)
       '("k" . cur/other-window-reverse)
       ;'("l" . )
       (cons ";" cur/sub-leader-keymap)
       '("RET"   . counsel-M-x)

       ;; ===4th Row===
       (cons "z" cur/alignment-map)
       ;'("x" . )
       ;'("c" . )
       ;'("v" . )
       '("b" . counsel-switch-buffer)
       '("B" . ibuffer)
       ;'("n" . )
       ;'("m" . )
       '("," . meow-bounds-of-thing)
       '("." . meow-inner-of-thing)
       '("/" . rg)
       ;'("'"  . )
       )
      (meow-normal-define-key
       ;; ===Top Row===
       '("1" . meow-expand-1)
       ;'("!" . )
       '("2" . meow-expand-2)
       ;'("@" . )
       '("3" . meow-expand-3)
       ;'("#" . )
       '("4" . meow-expand-4)
       ;'("$" . )
       '("5" . meow-expand-5)
       ;'("%" . )
       '("6" . meow-expand-6)
       ;'("^" . )
       '("7" . meow-expand-7)
       ;'("&" . )
       '("8" . meow-expand-8)
       ;'("*" . )
       '("9" . meow-expand-9)
       ;'("(" . )
       '("0" . meow-expand-0)
       ;'(")" . )

       ;; ===2nd Row===
       ;'("TAB"  . )
       ;'("BTAB" . )
       '("q" . kmacro-end-and-call-macro)
       '("Q" . cur/kmacro-toggle)
       '("w" . meow-mark-word)
       '("W" . meow-mark-symbol)
       '("e" . meow-next-word)
       '("E" . meow-next-symbol)
       '("r" . meow-replace)
       ;'("R" . )
       '("t" . meow-till)
       '("T" . meow-till-expand)
       '("y" . meow-save)
       '("Y" . meow-clipboard-save)
       '("u" . meow-undo)
       ;'("U" . )
       '("i" . meow-insert)
       ;'("I" . )
       '("o" . meow-open-below)
       '("O" . meow-open-above)
       '("p" . meow-yank)
       '("P" . meow-clipboard-yank)
       '("-" . negative-argument)
       ;'("_" . )

       ;; ===3rd Row===
       '("<escape>" . keyboard-quit)
       '("a" . meow-append)
       ;'("A" . )
       '("s" . repeat)
       ;'("S" . )
       '("d" . meow-kill)
       '("D" . meow-c-k)
       '("f" . meow-find)
       '("F" . meow-find-expand)
       '("g" . meow-cancel-selection)
       '("G" . meow-grab)
       '("h" . meow-left)
       '("H" . meow-left-expand)
       '("j" . meow-next)
       '("J" . meow-next-expand)
       '("k" . meow-prev)
       '("K" . meow-prev-expand)
       '("l" . meow-right)
       '("L" . meow-right-expand)
       '(";" . meow-reverse)
       '(":" . meow-page-up)
       '("RET" . "C-c")
       ;'("S-RET" . )

       ;; ===4th Row===
       '("z" . meow-pop-selection)
       ;'("Z" . )
       '("x" . meow-line)
       '("X" . meow-line-expand)
       '("c" . meow-change)
       ;'("C" . )
       ;'("v" . )
       ;'("V" . )
       '("b" . meow-back-word)
       '("B" . meow-back-symbol)
       '("n" . meow-search)
       '("N" . meow-goto-line)
       '("m" . meow-join)
       ;'("M" . )
       '("," . meow-beginning-of-thing)
       '("<" . meow-bounds-of-thing)
       '("." . meow-end-of-thing)
       '(">" . meow-inner-of-thing)
       '("/" . meow-visit)
       '("?" . meow-page-down)
       '("'"  . meow-block)
       '("\"" . meow-to-block)))
    :init
    (defhydra cur/hydra-buffer-cycle (:timeout 4)
      "tab through buffers"
      ("n" next-buffer "next buffer")
      ("p" previous-buffer "previous buffer")
      ("f" nil "finished" :exit t)
      ("RET" nil "finished" :exit t))
    :custom
    (meow-mode-state-list
     '((authinfo-mode . normal)
       (beancount-mode . normal)
       (bibtex-mode . normal)
       (cider-repl-mode . normal)
       (cider-test-report-mode . normal)
       (cider-browse-spec-view-mode . motion)
       (cargo-process-mode . normal)
       (conf-mode . normal)
       (deadgrep-edit-mode . normal)
       (deft-mode . normal)
       (diff-mode . normal)
       (dired-mode . motion)
       (eat-mode . insert)
       (ediff-mode . motion)
       (eshell-mode . insert)
       (gud-mode . normal)
       (haskell-interactive-mode . normal)
       (help-mode . normal)
       (helpful-mode . normal)
       (json-mode . normal)
       (jupyter-repl-mode . normal)
       (mix-mode . normal)
       (occur-edit-mode . normal)
       (pass-view-mode . normal)
       (prog-mode . normal)
       (py-shell-mode . normal)
       (restclient-mode . normal)
       (telega-chat-mode . normal)
       (term-mode . normal)
       (text-mode . normal)
       (vterm-mode . normal)
       (Custom-mode . normal))
     "Default meow states for modes")
    (meow-selection-command-fallback
     '((meow-change . meow-change-char)
       (meow-kill . meow-C-d)
       (meow-cancel-selection . keyboard-quit)
       (meow-pop-selection . meow-pop-grab)
       (meow-beacon-change . meow-beacon-change-char))
     "Meow fallback commands")
    (meow-keypad-describe-delay 0.0 "No delay in keypad help popup")
    (meow-cheats-layout meow-cheatsheet-layout-qwerty "Meow qwerty layout for the cheatsheet")
    :bind (:map cur/sub-leader-keymap
                ("C-b"   . ibuffer))
    :config
    (setq meow-kteypad-leader-dispatch nil)
    (meow-setup)
    (meow-global-mode 1))
#+end_src

#+begin_src emacs-lisp
  (provide 'cur-config-bindings)
  ;;; cur-config-bindings.el ends here
#+end_src

** Help configurations (=cur-config-help.el=)
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./cur-config/cur-config-help.el
:END:

#+begin_src emacs-lisp
  ;;; cur-config-help.el --- help configurations

  ;;; Commentary:

  ;;; Code:
#+end_src

#+begin_src emacs-lisp
  ;; ===which-key===
  (use-package which-key
    :demand t
    :init (which-key-mode)
    :diminish which-key-mode
    :config
    (setq which-key-idle-delay 0.0001))
#+end_src

#+begin_src emacs-lisp
  ;; ===helpful===
  (use-package helpful
    :custom
    (counsel-describe-function-function #'helpful-callable)
    (counsel-describe-variable-function #'helpful-variable)
    :bind
    ([remap describe-function] . counsel-describe-function)
    ([remap describe-command] . helpful-command)
    ([remap describe-variable] . counsel-describe-variable)
    ([remap describe-key] . helpful-key))
#+end_src

#+begin_src emacs-lisp
  ;; ===Info===
  (use-package info
    :config
    (setq meow-info-keymap (make-keymap))
    (meow-define-state info
      "meow state for interacting with Info"
      :lighter "INFO"
      :keymap meow-info-keymap)
    (meow-define-keys 'info
      '(":" . meow-page-up)
      '("?" . meow-page-down)
      '("," . beginning-of-buffer)
      '("." . end-of-buffer)
      ; '("a" . )
      ; '("b" . )
      ; '("c" . Info-follow-reference)
      ; '("d" . )
      ; '("e" . )
      '("f" . Info-menu)
      '("g" . keyboard-quit)
      '("h" . Info-backward-node)
      '("H" . meow-left)
      '("i" . Info-index)
      '("j" . meow-next)
      '("k" . meow-prev)
      '("l" . Info-forward-node)
      '("L" . meow-right)
      '("m" . meow-join)
      '("n" . Info-next)
      ; '("o" . )
      '("p" . Info-prev)
      '("q" . meow-goto-line)
      '("r" . Info-follow-reference)
      ; '("s" . )
      '("t" . Info-toc)
      '("u" . Info-up)
      '("v" . meow-visit)
      ; '("w" . )
      ; '("x" . )
      '("y" . Info-copy-current-node-name)
      '("z" . info-display-manual)
      '("RET" . Info-follow-nearest-node)
      '("SPC" . meow-keypad)
      '("TAB" . Info-next-reference)
      '("<backtab>" . Info-prev-reference)
      '("<escape>" . keyboard-quit))
    (add-hook 'Info-mode-hook #'meow-info-mode))
#+end_src

#+begin_src emacs-lisp
  (provide 'cur-config-help)
  ;;; cur-config-help.el ends here
#+end_src

** Dired configuration (=cur-config-dired.el=)
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./cur-config/cur-config-dired.el
:END:

#+begin_src emacs-lisp
  ;;; cur-config-dired.el --- configurations for dired

  ;;; Commentary:

  ;;; Code:
#+end_src

#+begin_src emacs-lisp
  ;; ===Dired Icons===
  (use-package nerd-icons-dired
    :after (dired)
    :hook (dired-mode . nerd-icons-dired-mode))
#+end_src

#+begin_src emacs-lisp
  ;; ===Dired===
  (use-package dired
    :hook
    (dired-mode . dired-hide-details-mode)
    (dired-mode . hl-line-mode)
    ;; TODO: create a dired-find-file-dwim for external programs
    :bind (:map dired-mode-map
                ;; ===Top Row===
                ;; ("1" . )
                ;; ("!" . )
                ;; ("2" . )
                ;; ("@" . )
                ;; ("3" . )
                ;; ("#" . )
                ;; ("4" . )
                ;; ("$" . )
                ;; ("5" . )
                ;; ("%" . )
                ;; ("6" . )
                ;; ("^" . )
                ;; ("7" . )
                ;; ("&" . )
                ;; ("8" . )
                ;; ("*" . )
                ;; ("9" . )
                ;; ("(" . )
                ;; ("0" . )
                ;; (")" . )

                ;; ===2nd Row===
                ;; ("TAB"  . )
                ;; ("BTAB" . )
                ("q" . kmacro-end-and-call-macro)
                ("Q" . cur/kmacro-toggle)
                ;; ("w" . )
                ;; ("W" . )
                ;; ("e" . )
                ;; ("E" . )
                ("r" . dired-do-rename)
                ("R" . dired-toggle-read-only)
                ("t" . dired-toggle-marks)
                ;; ("T" . )
                ;; ("y" . )
                ;; ("Y" . )
                ("u" . dired-unmark)
                ("U" . dired-unmark-all-marks)
                ("i" . dired-isearch-filenames-regexp)
                ("I" . dired-do-isearch-regexp)
                ;; ("o" . )
                ("O" . dired-do-chown)
                ("p" . dired-previous-line)
                ;; ("P" . )
                ("-" . negative-argument)
                ;; ("_" . )

                ;; ===3rd Row===
                ("<escape>" . keyboard-quit)
                ;; ("a" . )
                ;; ("A" . )
                ;; ("s" . )
                ;; ("S" . )
                ("d" . dired-do-kill-lines)
                ("D" . dired-do-delete)
                ("f" . find-file)
                ;; ("F" . )
                ("g" . revert-buffer)
                ;; ("G" . )
                ("h" . dired-up-directory)
                ;; ("H" . )
                ("j" . dired-next-line)
                ;; ("J" . )
                ("k" . dired-previous-line)
                ;; ("K" . )
                ("l" . dired-find-file)
                ("L" . dired-find-file-other-window)
                ;; (";" . )
                ;; (":" . )
                ("RET" . dired-find-file)
                ;; ("S-RET" . )

                ;; ===4th Row===
                ("z" . dired-undo)
                ;; ("Z" . )
                ("x" . dired-mark)
                ;; ("X" . )
                ("c" . dired-do-copy)
                ("C" . dired-do-copy-regexp)
                ("v" . dired-find-file-other-window)
                ;; ("V" . )
                ;; ("b" . )
                ;; ("B" . )
                ("n" . dired-next-line)
                ;; ("N" . )
                ("m" . dired-mark-files-regexp)
                ("M" . dired-do-chmod)
                ;; ("," . )
                ;; ("<" . )
                ;; ("." . )
                ;; (">" . )
                ("/" . dired-goto-file)
                ;; ("?" . )
                ;; ("'"  . )
                ;; ("\"" . )
                )
    :config
    (setq delete-by-moving-to-trash t)
    (setq dired-recursive-copies t)
    (setq dired-recursive-deletes t)
    (setq dired-listing-switches "-A -G -F -h -l -v --group-directories-first --time-style=long-iso")
    (setq dired-dwim-target t)
    (setq dired-auto-revert-buffer #'dired-directory-changed-p)
    (setq dired-free-space nil)
    (setq dired-make-directory-clickable t)
    (setq dired-mouse-drag-files t))
#+end_src

#+begin_src emacs-lisp
  (provide 'cur-config-dired)
  ;;; cur-config-dired.el ends here
#+end_src

** Faces and theme configurations (=cur-config-faces.el=)
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./cur-config/cur-config-faces.el
:END:

#+begin_src emacs-lisp
  ;;; cur-config-faces.el --- faces configuration

  ;;; Commentary:

  ;;; Code:
#+end_src

#+begin_src emacs-lisp
  ;; ===Default Font===
  (add-to-list 'default-frame-alist
               '(font . "JetBrains Mono Nerd Font-11"))
#+end_src

#+begin_src emacs-lisp
  ;; ===Themes Path===
  (add-to-list 'custom-theme-load-path (locate-user-emacs-file "themes"))

#+end_src

#+begin_src emacs-lisp
  ;; ===Doom Emacs Themes===
  (use-package doom-themes
    :demand t
    :init
    (defun cur/theme-override ()
      "Change faces depending on what the value of `custom-enabled-themes' is."
      (cond ((member 'doom-gruvbox custom-enabled-themes)
             (set-face-attribute 'secondary-selection nil
                                 :background "#504945"))
            ((member 'doom-flatwhite custom-enabled-themes)
             (set-face-attribute 'haskell-operator-face nil
                                 :background (doom-color 'bg)
                                 :foreground (doom-color 'fg))
             (set-face-attribute 'haskell-type-face nil
                                 :background (doom-color 'fw-teal-blend)
                                 :foreground (doom-color 'fw-teal-text))
             (set-face-attribute 'haskell-constructor-face nil
                                 :background (doom-color 'fw-orange-blend)
                                 :foreground (doom-color 'fw-orange-text)))
            (t t)))
    (defun cur/load-theme (theme)
      "Load THEME, disabling all other currently enabled themes. Then
  check for overrides with `cur/theme-override'."
      (interactive
       (list
        (intern (completing-read "Cur Custom Themes: "
                                 (mapcar #'symbol-name
                                         (custom-available-themes))))))
      (condition-case nil
          (progn
            (mapc #'disable-theme custom-enabled-themes)
            (load-theme theme t)
            (cur/theme-override))
        (error "Problem loading theme %s" theme)))
    :bind (:map cur/toggle-map
                ("C-t" . cur/load-theme))
    :config
    (cur/load-theme 'catppuccin))
#+end_src

#+begin_src emacs-lisp
  ;; ===Autothemer===
  (use-package autothemer)
#+end_src

#+begin_src emacs-lisp
  ;; ===Catppuccin Theme===
  (use-package catppuccin-theme
    :after (autothemer))
#+end_src

#+begin_src emacs-lisp
  ;; ===Text Scaling===
  (defhydra hydra-text-scale (:timeout 4)
    "scale text"
    ("k" text-scale-increase "in")
    ("j" text-scale-decrease "out")
    ("f" nil "finished" :exit t)
    ("RET" nil "finished" :exit t))
  (define-key cur/toggle-map (kbd "C-s") 'hydra-text-scale/body)
#+end_src

#+begin_src emacs-lisp
  ;; ===Ef-Themes===
  (use-package ef-themes)
#+end_src

#+begin_src emacs-lisp
  ;; ===Ibuffer Icons===
  (use-package nerd-icons-ibuffer
    :hook (ibuffer-mode . nerd-icons-ibuffer-mode))
#+end_src

#+begin_src emacs-lisp
  (provide 'cur-config-faces)
  ;;; cur-config-faces.el ends here
#+end_src

* Custom Library Modules
